import React from 'react'

// 一級路由中又內嵌了其他路由,這種關係就叫做嵌套路由,
// 嵌套至一級路由內的路由又稱為二級路由

//---------------------------------------------------
//|    --------------       ---------------------   |
//|    |  -------   |       |                   |   |
//|    |  | 看板 |  |       |                   |   |
//|    |  -------   |       |                   |   |
//|    |            |       |   二級路由出口     |   |
//|    |  -------   |       |                   |   |
//|    |  | 關於 |  |       |                   |   |
//|    |  -------   |       |                   |   |
//|    |            |       |                   |   |
//|    |            |       |                   |   |
//|    --------------       ---------------------   |
//|             Layour component                    |
//---------------------------------------------------

// Layour component是一級路由
// 看板和關於也是二級路由
// 點選看板 右側二級路由出口會顯示看板內容
// 點選關於 右側二級路由出口會顯示關於內容

// 實現步驟:
// 1.使用children 屬性配置路由嵌套關係
// 2.使用<Outlet/> 組件配置二級路由渲染位置

// 建立
// About資料夾index.js關於組件
// Layout資料夾index.js組件
// Board資料夾index.js面板組件


// const router = createBrowserRouter([
//     // 一級
//     {
//         path:'/',
//         element:<Layout1/>,
//         children:[
//             // 兩個二級
//             {
//                 path:'board',
//                 element:<Board/>
//             },
//             {
//                 path:'about',
//                 element:<About/>
//             }
//         ]
//     },


export default function RouterConfiguration() {
  return (
    <div>
      
    </div>
  )
}
