// ------------------------------------------------------------------------

// Home-Echarts基礎圖表實現

// 三方圖表插件如何在項目中快速使用起來?
// 1.按照三方插件文檔中的 "快速開始" , 快速跑起來Demo
// 2.按照業務需求修改配置項而做定制處理

// 安裝 Echarts圖表
// npm install echarts

// 1.先準備要掛載的節點
// 2.調用init內置方法把節點傳入生成實例
// 3.準備圖表的參數配置
// 4.使用圖表參數完成圖表渲染
// 5.在useEffect做初始化,保證dom節點可用
// 6.圖表節點要具備寬高

// ------------------------------------------------------------------------

// Home-Echarts組件封裝

// 解決復用
// 將兩圖表把不一樣的部分,抽象成props參數做適配

// 保持功能代碼不變抽象成組件  =>  替換可變的部分變成prop參數